Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
/**
 * Visual SLAM Navigation Module for INAV
 * ESP32-P4-WIFI6 with OV5647 MIPI-CSI Camera
 * Complete navigation system with real-time web interface
 */

#include <stdio.h>
#include <string.h>
#include <time.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <freertos/event_groups.h>
#include <esp_log.h>
#include <esp_system.h>
// #include <esp_wifi.h>  // WIFI remote disabled temporarily
#include <driver/spi_master.h>
#include <esp_event.h>
#include <esp_netif.h>
#include <nvs_flash.h>
#include <driver/gpio.h>
#include <esp_timer.h>
#include <esp_heap_caps.h>

// Visual SLAM Components
#include "visual_slam_common_types.h"
#include "slam_core.h"
#include "orb_features.h"
#include "sensor_fusion.h"
#include "communication_manager.h"  // Communication with ESP32-C6
#include "sd_storage.h"
#include "gps_ublox.h"    // GPS uBlox module
#include "imu_bmi088.h"   // BMI088 IMU sensor
#include "msp_protocol.h" // MSP protocol for INAV
#include "config_loader.h" // Configuration management
#include "assistnow.h"    // AssistNow Offline GPS enhancement
#include "wifi_assistnow.h" // WiFi for AssistNow downloads
#include "wifi_positioning.h" // WiFi positioning using WiGLE database

// Centralized pin configuration
#include "esp32p4_pin_config.h"

static const char *TAG = "VisualSLAM_INAV";

// System synchronization
static SemaphoreHandle_t system_mutex;
static EventGroupHandle_t system_event_group;

// System state flags
#define CAMERA_READY_BIT        BIT0
#define GPS_READY_BIT          BIT1
#define IMU_READY_BIT          BIT2
#define SLAM_READY_BIT         BIT3
#define WEB_SERVER_READY_BIT   BIT4  // WIFI remote enabled
#define ALL_SYSTEMS_READY      (CAMERA_READY_BIT | GPS_READY_BIT | IMU_READY_BIT | SLAM_READY_BIT)

// Task handles
static TaskHandle_t main_processing_task_handle = NULL;
static TaskHandle_t web_interface_task_handle = NULL;
static TaskHandle_t telemetry_broadcast_task_handle = NULL;
static TaskHandle_t sensor_monitoring_task_handle = NULL;

// System status instance
static system_status_t system_status = {0};

// WIFI remote functionality
// static bool wifi_enabled = false;
// static bool wifi_connected = false;
// static SemaphoreHandle_t wifi_mutex = NULL;

// Forward declarations for WIFI functions
// static void IRAM_ATTR wifi_toggle_button_isr(void* arg);
// static void wifi_toggle_task(void* arg);
// static esp_err_t wifi_enable(void);
// static esp_err_t wifi_disable(void);

// Master configuration instance
static master_config_t master_config = {0};

/**
 * Initialize NVS (Non-Volatile Storage)
 */
static void initialize_nvs(void)
{
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    ESP_LOGI(TAG, "✅ NVS initialized");
}

/**
 * Initialize system GPIO pins
 */
static void initialize_gpio(void)
{
    // LED indicators for system status
    gpio_config_t gpio_conf = {
        .intr_type = GPIO_INTR_DISABLE,
        .mode = GPIO_MODE_OUTPUT,
        .pin_bit_mask = (1ULL << SYSTEM_STATUS_LED_PIN) |
                       (1ULL << SLAM_ACTIVITY_LED_PIN) |
                       (1ULL << COMMUNICATION_LED_PIN),
        .pull_down_en = 0,
        .pull_up_en = 0,
    };
    gpio_config(&gpio_conf);

    // WIFI toggle button input
    // gpio_config_t button_conf = {
    //     .intr_type = GPIO_INTR_NEGEDGE,  // Trigger on falling edge (button press)
    //     .mode = GPIO_MODE_INPUT,
    //     .pin_bit_mask = (1ULL << WIFI_TOGGLE_BUTTON_PIN),
    //     .pull_down_en = 0,
    //     .pull_up_en = 1,  // Enable internal pull-up resistor
    // };
    // gpio_config(&button_conf);

    // Install GPIO ISR service for button interrupt
    // gpio_install_isr_service(0);
    // gpio_isr_handler_add(WIFI_TOGGLE_BUTTON_PIN, wifi_toggle_button_isr, NULL);

    // Set initial LED states
    gpio_set_level(SYSTEM_STATUS_LED_PIN, 0);   // System status LED
    gpio_set_level(SLAM_ACTIVITY_LED_PIN, 0);   // SLAM activity LED
    gpio_set_level(COMMUNICATION_LED_PIN, 0);   // Communication LED

    ESP_LOGI(TAG, "✅ GPIO initialized - Status LEDs: GPIO%d, SLAM: GPIO%d, Comm: GPIO%d",
             SYSTEM_STATUS_LED_PIN, SLAM_ACTIVITY_LED_PIN, COMMUNICATION_LED_PIN);
}

/**
 * Save current configuration to SD card
 */
static esp_err_t save_configuration_to_sd(void)
{
    if (!master_config.loaded) {
        ESP_LOGW(TAG, "⚠️ No configuration loaded, cannot save to SD card");
        return ESP_ERR_INVALID_STATE;
    }

    ESP_LOGI(TAG, "💾 Saving configuration to SD card...");
    esp_err_t ret = config_loader_save_to_sd(&master_config);

    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Configuration saved to SD card successfully");
    } else {
        ESP_LOGE(TAG, "❌ Failed to save configuration to SD card: %s", esp_err_to_name(ret));
    }

    return ret;
}

/**
 * Initialize camera system (OV5647 MIPI-CSI)
 */
static esp_err_t initialize_camera(void)
{
    ESP_LOGI(TAG, "🎥 Initializing OV5647 MIPI-CSI camera...");
    
    // Initialize camera configuration - use loaded config if available
    camera_config_t camera_config;
    if (master_config.loaded) {
        ESP_LOGI(TAG, "📷 Using loaded camera configuration");
        camera_config.resolution = master_config.camera.base_config.resolution;
        camera_config.format = master_config.camera.base_config.format;
        camera_config.fps = master_config.camera.base_config.fps;
        camera_config.auto_exposure = master_config.camera.base_config.auto_exposure;
        camera_config.auto_white_balance = master_config.camera.base_config.auto_white_balance;
        camera_config.brightness = master_config.camera.base_config.brightness;
        camera_config.contrast = master_config.camera.base_config.contrast;
        camera_config.saturation = master_config.camera.base_config.saturation;
        camera_config.exposure_value = master_config.camera.base_config.exposure_value;
        camera_config.auto_adjustment_enabled = master_config.camera.base_config.auto_adjustment_enabled;
        camera_config.target_brightness = master_config.camera.base_config.target_brightness;
        camera_config.adjustment_speed = master_config.camera.base_config.adjustment_speed;
        camera_config.brightness_threshold = master_config.camera.base_config.brightness_threshold;
    } else {
        ESP_LOGI(TAG, "📷 Using default camera configuration");
        // Use hardcoded defaults
        camera_config.resolution = CAMERA_RES_640x480;
        camera_config.format = CAMERA_FORMAT_RGB565;
        camera_config.fps = 30;
        camera_config.auto_exposure = true;
        camera_config.auto_white_balance = true;
        camera_config.brightness = 0;
        camera_config.contrast = 0;
        camera_config.saturation = 0;
        camera_config.exposure_value = 100;
        camera_config.auto_adjustment_enabled = true;
        camera_config.target_brightness = 128;
        camera_config.adjustment_speed = 0.3f;
        camera_config.brightness_threshold = 20.0f;
    }
    
