Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
            // Process frame through ORB feature detection
            uint64_t feature_start_time = esp_timer_get_time();
            orb_features_t features;
            ret = orb_features_extract(&frame, &features);
            uint64_t feature_end_time = esp_timer_get_time();
            float feature_processing_time = (feature_end_time - feature_start_time) / 1000.0f;
            
            if (ret == ESP_OK) {
                system_status.feature_count = features.count;
                
                // Get sensor fusion data
                sensor_fusion_data_t sensor_data;
                sensor_fusion_get_data(&sensor_data);
                
                // Update WiFi positioning periodically (every 10 frames = ~3 Hz)
                static uint32_t wifi_counter = 0;
                if (++wifi_counter >= 10 && wifi_positioning_is_available()) {
                    wifi_counter = 0;
                    wifi_position_t wifi_pos;
                    esp_err_t wifi_ret = wifi_positioning_get_position(&wifi_pos);
                    if (wifi_ret == ESP_OK && wifi_pos.valid) {
                        // Update sensor fusion with WiFi position
                        sensor_fusion_update_wifi(&wifi_pos);
                        
                        // Log WiFi position data
                        ESP_LOGD(TAG, "WiFi position: %.6f, %.6f (accuracy: %.1fm)",
                                wifi_pos.latitude, wifi_pos.longitude, wifi_pos.accuracy_h);
                    }
                }
                
                // Log data periodically to reduce SD card wear (every 10 frames = ~3 Hz)
                if (system_status.frame_count % 10 == 0) {
                    // Log feature extraction data
                    sd_storage_log_feature_data(loop_start_time, features.count, 
                                              features.num_good_matches, feature_processing_time);
                    
                    // Log sensor data (GPS, IMU)
                    sd_storage_log_sensor_data(loop_start_time,
                                              sensor_data.gps_data.latitude, sensor_data.gps_data.longitude, sensor_data.gps_data.altitude,
                                              sensor_data.imu_data.accel_x, sensor_data.imu_data.accel_y, sensor_data.imu_data.accel_z,
                                              sensor_data.imu_data.gyro_x, sensor_data.imu_data.gyro_y, sensor_data.imu_data.gyro_z);
                }
                
                // Update system status
                system_status.position_x = sensor_data.position.x;
                system_status.position_y = sensor_data.position.y;
                system_status.position_z = sensor_data.position.z;
                system_status.attitude_roll = sensor_data.attitude.roll;
                system_status.attitude_pitch = sensor_data.attitude.pitch;
                system_status.attitude_yaw = sensor_data.attitude.yaw;
                
                // Process through SLAM core  
                slam_pose_t slam_pose;
                ret = slam_core_process_frame(&frame, &slam_pose);
                
                if (ret == ESP_OK) {
                    // Log SLAM pose for mission recording (if active)
                    log_current_slam_pose();
                    
                    // Get SLAM system statistics and log them
                    slam_stats_t slam_stats;
                    esp_err_t stats_ret = slam_core_get_stats(&slam_stats);
                    if (stats_ret == ESP_OK) {
                        sd_storage_log_system_status(loop_start_time, &slam_stats);
                    }
                } else {
                    // Log SLAM processing error
                    sd_storage_log_error_event(loop_start_time, "SLAM_CORE", ret, 
                                              "Failed to process camera frame");
                }
            } else {
                // Log feature extraction error
                sd_storage_log_error_event(loop_start_time, "ORB_FEATURES", ret, 
                                          "Failed to extract ORB features");
            }
            
            // Release frame buffer
            slam_core_release_frame(&frame);
        } else {
            // Log camera frame error
            if (ret != ESP_OK) {
                sd_storage_log_error_event(loop_start_time, "CAMERA", ret, 
                                          "Failed to get camera frame");
            }
        }
        
        // Log memory usage every 30 seconds (at ~30 FPS)
        if (loop_counter % 900 == 0) {
            sd_storage_log_memory_usage(loop_start_time);
        }
        
        // Check for auto-save conditions (every few iterations)
        static uint32_t auto_save_counter = 0;
        if (++auto_save_counter >= 1000) {  // Check every ~33 seconds at 30Hz
            auto_save_map_if_needed();
            auto_save_counter = 0;
            
            // Log system health status
            ESP_LOGI(TAG, "🧠 SLAM Status: frames=%lu, features=%lu, mem_free=%zu KB", 
                     system_status.frame_count, system_status.feature_count,
                     heap_caps_get_free_size(MALLOC_CAP_8BIT) / 1024);
        }
        
        // Maintain consistent timing
        vTaskDelayUntil(&last_wake_time, frequency);
    }
}

/**
 * Web interface task - handles HTTP server and WebSocket communications
 */
static void web_interface_task(void *pvParameters)
{
    ESP_LOGI(TAG, "🌐 Web interface task started");

    // Wait for WiFi manager to be ready if WiFi is enabled
    if (master_config.loaded && master_config.system.wifi_enabled) {
        ESP_LOGI(TAG, "🌐 Waiting for WiFi manager to establish connection...");

        // Wait up to 30 seconds for WiFi to be ready
        uint32_t wait_count = 0;
        while (wait_count < 30) {
            wifi_manager_status_t wifi_status = wifi_manager_get_status();

            if (wifi_status == WIFI_MGR_STATUS_CONNECTED ||
                wifi_status == WIFI_MGR_STATUS_AP_MODE) {
                ESP_LOGI(TAG, "🌐 WiFi connection established, starting web server");

