Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
        vTaskDelay(pdMS_TO_TICKS(5000)); // Check every 5 seconds
    }
}

/**
 * WIFI toggle button interrupt service routine
 */
/*
static void IRAM_ATTR wifi_toggle_button_isr(void* arg)
{
    // Create a task to handle WIFI toggle to avoid ISR complexity
    xTaskCreate(wifi_toggle_task, "wifi_toggle", 2048, NULL, 5, NULL);
}
*/

/**
 * WIFI toggle task - handles WIFI on/off logic
 */
/*
void wifi_toggle_task(void* arg)
{
    // Debounce delay
    vTaskDelay(pdMS_TO_TICKS(50));

    // Check if button is still pressed (debounce)
    if (gpio_get_level(WIFI_TOGGLE_BUTTON_PIN) == 0) {
        // Toggle WIFI state
        if (wifi_enabled) {
            wifi_disable();
        } else {
            wifi_enable();
        }
    }

    vTaskDelete(NULL);
}
*/

/**
 * Enable WIFI remote functionality
 */
/*
esp_err_t wifi_enable(void)
{
    if (wifi_enabled) {
        ESP_LOGW(TAG, "⚠️ WIFI is already enabled");
        return ESP_OK;
    }

    ESP_LOGI(TAG, "📡 Enabling WIFI remote...");

    // Take WIFI mutex
    if (xSemaphoreTake(wifi_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
        ESP_LOGE(TAG, "❌ Failed to acquire WIFI mutex");
        return ESP_ERR_TIMEOUT;
    }

    esp_err_t ret = ESP_OK;

    // Initialize WIFI if not already done
    if (!wifi_connected) {
        // Configure web server
        web_server_config_t config = {
            .port = 80,
            .max_clients = 4,
            .enable_cors = true,
            .enable_auth = false,
            .ssid = "DroneCam-SLAM",
            .password = "dronecam123",
            .channel = 6,
            .max_connection = 4
        };

        ret = web_server_init(&config);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "❌ Web server initialization failed: %s", esp_err_to_name(ret));
            xSemaphoreGive(wifi_mutex);
            return ret;
        }

        // Start WIFI in AP mode
        ret = web_server_wifi_start();
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "❌ WIFI AP start failed: %s", esp_err_to_name(ret));
            xSemaphoreGive(wifi_mutex);
            return ret;
        }

        // Start web server
        ret = web_server_start();
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "❌ Web server start failed: %s", esp_err_to_name(ret));
            xSemaphoreGive(wifi_mutex);
            return ret;
        }

        wifi_connected = true;
        system_status.web_server_running = true;
        xEventGroupSetBits(system_event_group, WEB_SERVER_READY_BIT);
    }

    wifi_enabled = true;
    xSemaphoreGive(wifi_mutex);

    // Download AssistNow data if needed and configured
    if (master_config.gps.assistnow_enabled &&
        strlen(master_config.gps.assistnow_token) > 0 &&
        assistnow_is_download_needed()) {

        ESP_LOGI(TAG, "📡 WiFi available - checking for AssistNow data update...");
        esp_err_t assistnow_ret = assistnow_download_data();
        if (assistnow_ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ AssistNow data downloaded successfully");

            // Load the new data to GPS
            assistnow_upload_to_gps();
        } else {
            ESP_LOGW(TAG, "⚠️ AssistNow data download failed: %s", esp_err_to_name(assistnow_ret));
        }
    }

    ESP_LOGI(TAG, "🌐 Web interface: Connect to WiFi or use captive portal");
    ESP_LOGI(TAG, "📱 Access dashboard at: http://dronecam.local or device IP");

    return ESP_OK;
}
*/

/**
 * Disable WIFI remote functionality
 */
/*
esp_err_t wifi_disable(void)
{
    if (!wifi_enabled) {
        ESP_LOGW(TAG, "⚠️ WIFI is already disabled");
        return ESP_OK;
    }

    ESP_LOGI(TAG, "📡 Disabling WIFI remote...");

    // Take WIFI mutex
    if (xSemaphoreTake(wifi_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
        ESP_LOGE(TAG, "❌ Failed to acquire WIFI mutex");
        return ESP_ERR_TIMEOUT;
    }

    esp_err_t ret = ESP_OK;

    // Stop web server and WIFI
    if (wifi_connected) {
        ret = web_server_stop();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "⚠️ Web server stop warning: %s", esp_err_to_name(ret));
        }

        ret = web_server_wifi_stop();
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "⚠️ WIFI stop warning: %s", esp_err_to_name(ret));
        }

        wifi_connected = false;
        system_status.web_server_running = false;
        xEventGroupClearBits(system_event_group, WEB_SERVER_READY_BIT);
    }

    wifi_enabled = false;
    xSemaphoreGive(wifi_mutex);

    ESP_LOGI(TAG, "✅ WIFI remote disabled");

    return ESP_OK;
}
*/

/**
 * Initialize WIFI system
 */
/*
static esp_err_t initialize_wifi(void)
{
    ESP_LOGI(TAG, "📡 Initializing WIFI system...");

    // Create WIFI mutex
    wifi_mutex = xSemaphoreCreateMutex();
    if (wifi_mutex == NULL) {
        ESP_LOGE(TAG, "❌ Failed to create WIFI mutex");
        return ESP_ERR_NO_MEM;
    }

    // Initialize WIFI state
    wifi_enabled = false;
    wifi_connected = false;

    ESP_LOGI(TAG, "✅ WIFI system initialized (disabled by default)");
    ESP_LOGI(TAG, "🔘 Press GPIO%d button to toggle WIFI on/off", WIFI_TOGGLE_BUTTON_PIN);

    return ESP_OK;
}
*/

/**
 * Application main entry point
 */
void app_main(void)
{
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "=================================================");
    ESP_LOGI(TAG, "🚁 Visual SLAM Navigation Module for INAV");
    ESP_LOGI(TAG, "📡 ESP32-P4-WIFI6 with OV5647 MIPI-CSI Camera");
    ESP_LOGI(TAG, "🧠 Real-time ORB-SLAM with Web Interface");
    ESP_LOGI(TAG, "=================================================");
    ESP_LOGI(TAG, "");

    // Validate pin assignments at compile time
    VALIDATE_ALL_PIN_ASSIGNMENTS;

    ESP_LOGI(TAG, "✅ Pin configuration validated - no conflicts detected");

    // Initialize system components
    initialize_nvs();
    initialize_gpio();

    // Initialize WIFI system (disabled by default)
    // initialize_wifi();

    // Create system synchronization objects
    system_mutex = xSemaphoreCreateMutex();
    system_event_group = xEventGroupCreate();
    
    if (system_mutex == NULL || system_event_group == NULL) {
        ESP_LOGE(TAG, "❌ Failed to create synchronization objects");
        return;
    }
    
    // Initialize TCP/IP stack (required for web server)
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    
    // Initialize hardware subsystems
    esp_err_t ret;
    
    // Initialize SD card storage FIRST (before components that need config)
    ESP_LOGI(TAG, "💾 Initializing SD card storage... (early init for config loading)");
    ret = map_manager_init();
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ SD card storage initialized successfully");

