Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
        // Initialize configuration loader
        ESP_LOGI(TAG, "⚙️ Initializing configuration loader... (early init for component config)");
        ret = config_loader_init();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ Configuration loader initialized successfully");

            // Load master configuration BEFORE initializing components
            ESP_LOGI(TAG, "📖 Loading master configuration... (before component init)");
            ret = config_loader_load_all(&master_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Master configuration loaded successfully");
                master_config.loaded = true;
            } else {
                ESP_LOGI(TAG, "ℹ️ No existing configuration found, creating defaults...");

                // Create default configuration files if they don't exist
                ESP_LOGI(TAG, "📝 Creating default configuration files...");
                ret = config_loader_create_defaults();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ Default configuration files created successfully");

                    // Now try to load the newly created defaults
                    ESP_LOGI(TAG, "📖 Loading newly created configuration...");
                    ret = config_loader_load_all(&master_config);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "✅ Default configuration loaded successfully");
                        master_config.loaded = true;
                    } else {
                        ESP_LOGE(TAG, "❌ Failed to load default configuration: %s", esp_err_to_name(ret));
                        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                    }
                } else {
                    ESP_LOGE(TAG, "❌ Failed to create default configuration files: %s", esp_err_to_name(ret));
                    ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                }
            }
        } else {
            ESP_LOGE(TAG, "❌ Configuration loader initialization failed: %s", esp_err_to_name(ret));
            ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
        }
    } else {
        ESP_LOGE(TAG, "❌ SD card storage initialization failed: %s", esp_err_to_name(ret));
        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults (no SD card available)");
    }
    
    // Initialize communication with ESP32-C6 slave (web server)
    ESP_LOGI(TAG, "� Initializing communication with ESP32-C6 slave...");
    ret = comm_manager_init();
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Communication manager initialized successfully");
        ESP_LOGI(TAG, "📡 ESP32-C6 will handle WiFi and web interface");
    } else {
        ESP_LOGE(TAG, "❌ Communication manager initialization failed: %s", esp_err_to_name(ret));
        ESP_LOGW(TAG, "⚠️ Continuing without C6 communication - SLAM system will still work");
    }    // Now initialize components with loaded configuration
    ret = initialize_camera();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Camera initialization failed, continuing anyway...");
    }
    
    ret = initialize_gps();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "GPS initialization failed, continuing anyway...");
    }
    
    ret = initialize_msp();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "MSP initialization failed, continuing anyway...");
    }
    
    // Initialize IMU
    ret = sensor_fusion_register_imu(&master_config.imu.base_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "IMU registration failed, continuing anyway...");
    }
    
    // List available maps (if SD card was initialized earlier)
    if (config_loader_is_sd_available()) {
        list_available_maps();

        // Try to load a default map if available
        ESP_LOGI(TAG, "🗺️ Checking for existing maps to load...");
        ret = load_slam_map(NULL);  // Load latest map
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ Existing map loaded successfully");
        } else {
            ESP_LOGI(TAG, "ℹ️ No existing map found, starting fresh");
        }
    }

            // First try to load existing configuration
            ESP_LOGI(TAG, "� Loading master configuration...");
            ret = config_loader_load_all(&master_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "✅ Master configuration loaded successfully");
                master_config.loaded = true;
            } else {
                ESP_LOGI(TAG, "ℹ️ No existing configuration found, creating defaults...");
                
                // Create default configuration files if they don't exist
                ESP_LOGI(TAG, "� Creating default configuration files...");
                ret = config_loader_create_defaults();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "✅ Default configuration files created successfully");
                    
                    // Now try to load the newly created defaults
                    ESP_LOGI(TAG, "📖 Loading newly created configuration...");
                    ret = config_loader_load_all(&master_config);
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "✅ Default configuration loaded successfully");
                        master_config.loaded = true;
                    } else {
                        ESP_LOGE(TAG, "❌ Failed to load default configuration: %s", esp_err_to_name(ret));
                        ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                    }
                } else {
                    ESP_LOGE(TAG, "❌ Failed to create default configuration files: %s", esp_err_to_name(ret));
                    ESP_LOGI(TAG, "⚠️ Continuing with built-in defaults");
                }
            }
    // Initialize SLAM system
    ret = initialize_slam();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SLAM initialization failed, continuing anyway...");
    }

    // Initialize WiFi positioning system
    ESP_LOGI(TAG, "📍 Initializing WiFi positioning system...");
    wifi_positioning_config_t wifi_pos_config = {
        .scan_interval_ms = 30000,        // Scan every 30 seconds
        .min_ap_count = 3,                // Need at least 3 APs
        .max_ap_count = 10,               // Use up to 10 APs
        .min_rssi_threshold = -85,        // Minimum RSSI -85dBm
        .wigle_db_size = 10000,           // Support up to 10k entries
        .wigle_db_path = "/sdcard/wigle/wigle.db",
        .enable_auto_scan = true,         // Enable automatic scanning
        .position_timeout_ms = 5000       // 5 second timeout
    };

    ret = wifi_positioning_init(&wifi_pos_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ WiFi positioning initialized successfully");

        // Start WiFi positioning
        ret = wifi_positioning_start();
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "✅ WiFi positioning started successfully");
        } else {
            ESP_LOGW(TAG, "⚠️ Failed to start WiFi positioning: %s", esp_err_to_name(ret));
        }
    } else {
        ESP_LOGW(TAG, "⚠️ WiFi positioning initialization failed: %s", esp_err_to_name(ret));
        ESP_LOGW(TAG, "ℹ️ Continuing without WiFi positioning - GPS/SLAM will still work");
    }

    // Save current configuration to SD card (if SD card is available)
    if (config_loader_is_sd_available()) {
        ESP_LOGI(TAG, "💾 Saving initial configuration to SD card...");
        save_configuration_to_sd();
    }

