Levi-5k/ESP32_P4_SLAM/main/visual_slam_main.c
    // Create main processing tasks with optimized stack sizes
    xTaskCreatePinnedToCore(
        main_processing_task,
        "main_processing",
        12288,  // Increased stack for SLAM processing
        NULL,
        5,
        &main_processing_task_handle,
        1  // Pin to core 1
    );
    
    xTaskCreatePinnedToCore(
        web_interface_task,
        "web_interface",
        6144,   // Reduced stack since WiFi is disabled
        NULL,
        4,
        &web_interface_task_handle,
        0  // Pin to core 0
    );
    
    xTaskCreatePinnedToCore(
        telemetry_broadcast_task,
        "telemetry_broadcast",
        3072,   // Reduced stack since telemetry is minimal
        NULL,
        3,
        &telemetry_broadcast_task_handle,
        0  // Pin to core 0
    );
    
    // Create sensor monitoring task for GPS/IMU/MSP reconnection
    xTaskCreatePinnedToCore(
        sensor_monitoring_task,
        "sensor_monitor",
        5120,   // Increased for UART operations
        NULL,
        2,
        &sensor_monitoring_task_handle,
        0  // Pin to core 0
    );
    
    ESP_LOGI(TAG, "🚀 Visual SLAM Navigation Module started successfully!");
    ESP_LOGI(TAG, "🌐 Web interface: Connect to WiFi or use captive portal");
    ESP_LOGI(TAG, "📱 Access dashboard at: http://dronecam.local or device IP");
    
    // Main loop - monitor system health
    while (1) {
        // Check task health
        if (main_processing_task_handle != NULL && 
            eTaskGetState(main_processing_task_handle) == eDeleted) {
            ESP_LOGE(TAG, "❌ Main processing task died - stopping logging and restarting system");
            sd_storage_stop_comprehensive_logging();
            esp_restart();
        }
        
        if (web_interface_task_handle != NULL && 
            eTaskGetState(web_interface_task_handle) == eDeleted) {
            ESP_LOGE(TAG, "❌ Web interface task died - stopping logging and restarting system");
            sd_storage_stop_comprehensive_logging();
            esp_restart();
        }
        
        vTaskDelay(pdMS_TO_TICKS(5000)); // Check every 5 seconds
    }
    
    // Cleanup (should never reach here, but good practice)
    sd_storage_stop_comprehensive_logging();
}
